app/Libraries/Nfse/last_soap_request.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://www.janelaunicaws.com.br/nfsews/v09" xmlns:ns2="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><SOAP-ENV:Header>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
            <wsu:Timestamp wsu:Id="Timestamp-694966afb0b37">
                <wsu:Created>2025-12-22T15:41:35Z</wsu:Created>
                <wsu:Expires>2025-12-22T15:46:35Z</wsu:Expires>
            </wsu:Timestamp>
            <wsse:UsernameToken wsu:Id="UsernameToken-694966afb0b39">
                <wsse:Username>6001232645</wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">bml22122022</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security></SOAP-ENV:Header><SOAP-ENV:Body><ns1:gerarNfse><loteRPServico><tipoLote>1</tipoLote><iIdentLote>1766418095</iIdentLote><recibosProvisoriosDeServicos><reciboProvisorioDeServico><dataEmissaoRps>2025-12-22</dataEmissaoRps><identificacaoTomadorServico><bairro>0</bairro><cep>68638000</cep><cidade>1506195</cidade><cpfCnpj>01461070201</cpfCnpj><endereco>Rua Nossa Senhora de Fátima</endereco><numeroEndereco>1011</numeroEndereco><razaoSocial>Adiane Mendes</razaoSocial><uf>PA</uf></identificacaoTomadorServico><itens><item><descricao>Serviço de Análise Laboratorial</descricao><quantidade>1</quantidade><total>25.00</total><valorUnitario>25.00</valorUnitario></item></itens><numeroRps>3</numeroRps><prestadorServico><cpfCnpj>59664321000133</cpfCnpj><inscricaoMunicipal>3003410</inscricaoMunicipal></prestadorServico><serieRps>1</serieRps><tipoRps>1</tipoRps><statusRps>1</statusRps><identificacaoPrestacaoServico><codigoCnae>8640202</codigoCnae><codigoTributacaoMunicipio>40301</codigoTributacaoMunicipio><competencia>2025-12-22</competencia><discriminacao>Serviço de Análise Laboratorial</discriminacao><exigibilidadeIss>1</exigibilidadeIss><incentivoFiscal>2</incentivoFiscal><issRetido>2</issRetido><itemListaServico>04.03</itemListaServico><municipioIncidencia>1506187</municipioIncidencia><municipioPrestacaoServico>1506187</municipioPrestacaoServico><optanteSimplesNacional>1</optanteSimplesNacional><valorServico>25.00</valorServico></identificacaoPrestacaoServico></reciboProvisorioDeServico></recibosProvisoriosDeServicos></loteRPServico></ns1:gerarNfse></SOAP-ENV:Body></SOAP-ENV:Envelope>
